pablobacho/esp32-manager/esp32_manager_webconfig.c
/**
 * esp32_manager_webconfig.c
 *
 * (C) 2019 - Pablo Bacho <pablo@pablobacho.com>
 * This code is licensed under the MIT License.
 */

 #include "esp32_manager_webconfig.h"

static const char * TAG = "esp32_manager_webconfig";

httpd_uri_t * esp32_manager_webconfig_uris[];

httpd_handle_t esp32_manager_webconfig_webserver;

char esp32_manager_webconfig_content[];
char esp32_manager_webconfig_buffer[] = "";

httpd_uri_t esp32_manager_webconfig_uri_root = {
    .uri = WEBCONFIG_MANAGER_URI_ROOT_URL,
    .method = HTTP_GET,
    .handler = esp32_manager_webconfig_uri_handler_root,
    .user_ctx = NULL
};

httpd_uri_t esp32_manager_webconfig_uri_css = {
    .uri = WEBCONFIG_MANAGER_URI_CSS_URL,
    .method = HTTP_GET,
    .handler = esp32_manager_webconfig_uri_handler_style,
    .user_ctx = NULL
};

httpd_uri_t esp32_manager_webconfig_uri_setup = {
    .uri = WEBCONFIG_MANAGER_URI_SETUP_URL,
    .method = HTTP_GET,
    .handler = esp32_manager_webconfig_uri_handler_setup,
    .user_ctx = NULL
};

httpd_uri_t esp32_manager_webconfig_uri_get = {
    .uri = WEBCONFIG_MANAGER_URI_GET_URL,
    .method = HTTP_GET,
    .handler = esp32_manager_webconfig_uri_handler_get,
    .user_ctx = NULL
};

httpd_uri_t esp32_manager_webconfig_uri_factory = {
    .uri = WEBCONFIG_MANAGER_URI_FACTORY_URL,
    .method = HTTP_GET,
    .handler = esp32_manager_webconfig_uri_handler_factory,
    .user_ctx = NULL
};

esp_err_t esp32_manager_webconfig_init()
{
    esp_err_t e;

    // Create uris
    esp32_manager_webconfig_uris[WEBCONFIG_MANAGER_URI_ROOT_INDEX] = &esp32_manager_webconfig_uri_root;
    esp32_manager_webconfig_uris[WEBCONFIG_MANAGER_URI_CSS_INDEX] = &esp32_manager_webconfig_uri_css;
    esp32_manager_webconfig_uris[WEBCONFIG_MANAGER_URI_SETUP_INDEX] = &esp32_manager_webconfig_uri_setup;
    esp32_manager_webconfig_uris[WEBCONFIG_MANAGER_URI_GET_INDEX] = &esp32_manager_webconfig_uri_get;
    esp32_manager_webconfig_uris[WEBCONFIG_MANAGER_URI_FACTORY_INDEX] = &esp32_manager_webconfig_uri_factory;

    // Register events relevant to the webserver
    e = esp_event_handler_register(ESP32_MANAGER_NETWORK_EVENT_BASE, ESP32_MANAGER_NETWORK_EVENT_STA_GOT_IP, esp32_manager_webconfig_event_handler, NULL);
    if(e == ESP_OK) {
        ESP_LOGD(TAG, "Registered for event STA_GOT_IP");
    } else {
        ESP_LOGE(TAG, "Error registering for event STA_GOT_IP");
        return ESP_FAIL;
    }

    e = esp_event_handler_register(ESP32_MANAGER_NETWORK_EVENT_BASE, ESP32_MANAGER_NETWORK_EVENT_STA_LOST_IP, esp32_manager_webconfig_event_handler, NULL);
    if(e == ESP_OK) {
        ESP_LOGD(TAG, "Registered for event STA_LOST_IP");
    } else {
        ESP_LOGE(TAG, "Error registering for event STA_LOST_IP");
        return ESP_FAIL;
    }

    e = esp_event_handler_register(ESP32_MANAGER_NETWORK_EVENT_BASE, ESP32_MANAGER_NETWORK_EVENT_AP_START, esp32_manager_webconfig_event_handler, NULL);
    if(e == ESP_OK) {
        ESP_LOGD(TAG, "Registered for event AP_START");
    } else {
        ESP_LOGE(TAG, "Error registering for event AP_START");
        return ESP_FAIL;
    }

    e = esp_event_handler_register(ESP32_MANAGER_NETWORK_EVENT_BASE, ESP32_MANAGER_NETWORK_EVENT_AP_STOP, esp32_manager_webconfig_event_handler, NULL);
    if(e == ESP_OK) {
        ESP_LOGD(TAG, "Registered for event AP_STOP");
    } else {
        ESP_LOGE(TAG, "Error registering for event AP_STOP");
        return ESP_FAIL;
    }

    return ESP_OK;
}

httpd_handle_t esp32_manager_webconfig_webserver_start()
{
    esp_err_t e;

    /* Generate default configuration */
    httpd_config_t config = HTTPD_DEFAULT_CONFIG();
    config.max_uri_handlers = WEBCONFIG_MANAGER_URIS_SIZE;

    /* Empty handle to esp_http_server */
    httpd_handle_t server = NULL;

    if(httpd_start(&server, &config) == ESP_OK) {
        // Register uris
        for(uint16_t i=0; i < WEBCONFIG_MANAGER_URIS_SIZE; ++i) {
            e = httpd_register_uri_handler(server, esp32_manager_webconfig_uris[i]);
            if(e == ESP_OK) {
                ESP_LOGD(TAG, "Registered uri %s", esp32_manager_webconfig_uris[i]->uri);
            } else {
                ESP_LOGE(TAG, "Error registering uri %s: %s", esp32_manager_webconfig_uris[i]->uri, esp_err_to_name(e));
                esp32_manager_webconfig_webserver_stop(&server);
                return NULL;
            }
        }
        ESP_LOGD(TAG, "Webserver started");
    } else {
        ESP_LOGE(TAG, "Error starting webserver");
    }

    return server;
}

void esp32_manager_webconfig_webserver_stop(httpd_handle_t * server)
{
    if(*server != NULL) {
        httpd_stop(*server);
        *server = NULL;
        ESP_LOGD(TAG, "Webserver stopped");
    } else {
        ESP_LOGD(TAG, "Webserver was already stopped");
    }
}

void esp32_manager_webconfig_event_handler(void * handler_arg, esp_event_base_t base, int32_t id, void * event_data)
{
    if(base != ESP32_MANAGER_NETWORK_EVENT_BASE) {
        return;
    }

    switch(id) {
        case ESP32_MANAGER_NETWORK_EVENT_STA_GOT_IP:
        case ESP32_MANAGER_NETWORK_EVENT_AP_START:
            esp32_manager_webconfig_webserver = esp32_manager_webconfig_webserver_start();
        break;
        case ESP32_MANAGER_NETWORK_EVENT_STA_LOST_IP:
        case ESP32_MANAGER_NETWORK_EVENT_AP_STOP:
            esp32_manager_webconfig_webserver_stop(&esp32_manager_webconfig_webserver);
        break;
        default: break;
    }
}

esp_err_t esp32_manager_webconfig_uri_handler_root(httpd_req_t *req)
{
    esp_err_t e;

    // Calculate size of request query
    size_t recv_size = MIN(httpd_req_get_url_query_len(req)+1, sizeof(esp32_manager_webconfig_content)-1);
    ESP_LOGD(TAG, "Request header size: %d", recv_size);

    // Get request query
    e = httpd_req_get_url_query_str(req, esp32_manager_webconfig_content, recv_size);
    if(e == ESP_OK) {
        ESP_LOGD(TAG, "Query string: %s", esp32_manager_webconfig_content);
        // Search for reboot key
        e = httpd_query_key_value(esp32_manager_webconfig_content, WEBCONFIG_MANAGER_URI_PARAM_REBOOT_DEVICE, esp32_manager_webconfig_buffer, sizeof(esp32_manager_webconfig_buffer));
        if(e == ESP_OK) { // Reboot parameter found in query
            e = esp32_manager_webconfig_page_reboot(esp32_manager_webconfig_buffer, req); // Generate HTML
            if(e == ESP_OK) {
                ESP_LOGD(TAG, "Reboot page generated");
            } else {
                ESP_LOGE(TAG, "Error generating reboot page");
                httpd_resp_set_status(req, HTTPD_500);
            }
            e = httpd_resp_send(req, esp32_manager_webconfig_buffer, strlen(esp32_manager_webconfig_buffer)); // Send it to client
            if(e == ESP_OK) {
                ESP_LOGD(TAG, "Page reboot response sent to client");
            } else {
                ESP_LOGE(TAG, "Error sending page reboot response to client");
            }
            ESP_LOGD(TAG, "Restarting in %d seconds", WEBCONFIG_MANAGER_REBOOT_DELAY / 1000);
            vTaskDelay(WEBCONFIG_MANAGER_REBOOT_DELAY / portTICK_PERIOD_MS); // Wait before rebooting
            esp_restart();
        }
    }

