pablobacho/esp32-manager/esp32_manager_webconfig.c
    e = esp32_manager_webconfig_page_root(esp32_manager_webconfig_buffer, req);
    if(e == ESP_OK) {
        ESP_LOGD(TAG, "Root document generated");
    } else {
        ESP_LOGE(TAG, "Error generating root document");
        httpd_resp_set_status(req, HTTPD_500);
    }

    e = httpd_resp_send(req, esp32_manager_webconfig_buffer, strlen(esp32_manager_webconfig_buffer));
    if(e == ESP_OK) {
        ESP_LOGD(TAG, "Response sent");
        return ESP_OK;
    } else {
        ESP_LOGE(TAG, "Error sending response");
        return ESP_FAIL;
    }
}

esp_err_t esp32_manager_webconfig_uri_handler_style(httpd_req_t *req)
{
    esp_err_t e;

    e = httpd_resp_set_hdr(req, "Cache-Control", "no-cache, no-store, must-revalidate");
    e += httpd_resp_set_hdr(req, "Pragma", "no-cache");
    e += httpd_resp_set_hdr(req, "Expires", "0");
    if(e != ESP_OK) {
        ESP_LOGE(TAG, "Error settings cache headers");
    }

    e = httpd_resp_send(req, (const char *) style_min_css_start, style_min_css_end-style_min_css_start);
    if(e == ESP_OK) {
        ESP_LOGD(TAG, "Response sent");
        return ESP_OK;
    } else {
        ESP_LOGE(TAG, "Error sending response");
        return ESP_FAIL;
    }
}

esp_err_t esp32_manager_webconfig_uri_handler_setup(httpd_req_t * req)
{
    esp_err_t e;

    // Calculate size of request query
    size_t recv_size = MIN(httpd_req_get_url_query_len(req)+1, sizeof(esp32_manager_webconfig_content)-1);
    ESP_LOGD(TAG, "Request header size: %d", recv_size);

    // Get request query
    e = httpd_req_get_url_query_str(req, esp32_manager_webconfig_content, recv_size);
    if(e == ESP_OK) {
        ESP_LOGD(TAG, "Query string: %s", esp32_manager_webconfig_content);
        // Search for namespace key
        e = httpd_query_key_value(esp32_manager_webconfig_content, WEBCONFIG_MANAGER_URI_PARAM_NAMESPACE, esp32_manager_webconfig_buffer, sizeof(esp32_manager_webconfig_buffer));
        if(e == ESP_OK) { // Requesting namespace page
            // Get namespace
            esp32_manager_namespace_t * namespace = NULL;
            for(uint8_t i=0; i < ESP32_MANAGER_NAMESPACES_SIZE; ++i) {
                if(esp32_manager_namespaces[i] != NULL) {
                    if(!strcmp(esp32_manager_webconfig_buffer, esp32_manager_namespaces[i]->key)) {
                        namespace = esp32_manager_namespaces[i];
                        break;
                    }
                }
            }
            // if namespace requested exists
            if(namespace != NULL) {
                ESP_LOGD(TAG, "Selected namespace %s", namespace->key);
                // Check if there are settings to update
                uint16_t entry_updated = 0; // Flag to mark if any settings were changed
                e = httpd_query_key_value(esp32_manager_webconfig_content, WEBCONFIG_MANAGER_URI_PARAM_FACTORY_RESET, esp32_manager_webconfig_buffer, sizeof(esp32_manager_webconfig_buffer));
                if(e == ESP_OK) {
                    e = esp32_manager_reset_namespace(namespace);
                    if(e == ESP_OK) {
                        ESP_LOGD(TAG, "Namespace %s entry values reset", namespace->key);
                        e = esp32_manager_namespace_nvs_erase(namespace);
                        if(e == ESP_OK) {
                            ESP_LOGD(TAG, "Namespace %s erased from NVS", namespace->key);
                        } else {
                            ESP_LOGD(TAG, "Error erasing namespace %s from NVS", namespace->key);
                        }
                    } else {
                        ESP_LOGE(TAG, "Error resetting namespace %s entry values", namespace->key);
                    }
                } else {
                    for(uint16_t i=0; i < namespace->size; ++i) {
                        esp32_manager_entry_t * entry = namespace->entries[i];
                        char encoded[100]; // FIXME Magic number
                        ESP_LOGD(TAG, "Searching for entry %s.%s", namespace->key, entry->key);
                        e = httpd_query_key_value(esp32_manager_webconfig_content, entry->key, encoded, sizeof(encoded));
                        if(e == ESP_OK) { // There is a setting to update
                            ESP_LOGD(TAG, "Value before decoding: %s", encoded);
                            esp32_manager_webconfig_urldecode(esp32_manager_webconfig_buffer, encoded); // Decode value from URL
                            ESP_LOGD(TAG, "Value after decoding: %s", esp32_manager_webconfig_buffer);
                            e = entry->from_string(entry, esp32_manager_webconfig_buffer);
                            if(e == ESP_OK) {
                                ESP_LOGD(TAG, "Entry %s.%s updated", namespace->key, entry->key);
                                ++entry_updated;
                            } else {
                                ESP_LOGE(TAG, "Error updating entry %s.%s to %s", namespace->key, entry->key, esp32_manager_webconfig_buffer);
                            }
                            e = entry->to_string(entry, encoded);
                            if(e == ESP_OK) {
                                ESP_LOGD(TAG, "Entry %s.%s content %s", namespace->key, entry->key, encoded);
                            } else {
                                ESP_LOGE(TAG, "Error converting entry %s.%s to string", namespace->key, entry->key);
                            }
                        } // Nothing to do if setting is not found in query string
                    }
                }
                if(entry_updated > 0) {
                    e = esp32_manager_commit_to_nvs(namespace); // Commit changes to namespace
                    if(e == ESP_OK) {
                        ESP_LOGD(TAG, "Entries updated and commited to NVS");
                    } else {
                        ESP_LOGE(TAG, "Error commiting changes to NVS: %s", esp_err_to_name(e));
                    }
                }
                // Generate response
                ESP_LOGD(TAG, "Generating response");
                e = esp32_manager_webconfig_page_setup_namespace(esp32_manager_webconfig_buffer, req, namespace);
                if(e == ESP_OK) {
                    ESP_LOGD(TAG, "Setup namespace page generated");
                } else {
                    ESP_LOGE(TAG, "Error generating namespace page: %s", esp_err_to_name(e));
                }
            } else { // namespace does not exist
                ESP_LOGW(TAG, "Requested namespace does not exist");
                e = esp32_manager_webconfig_page_setup(esp32_manager_webconfig_buffer, req);
                if(e == ESP_OK) {
                    ESP_LOGD(TAG, "Setup page generated");
                } else {
                    ESP_LOGE(TAG, "Error generating setup page");
                    httpd_resp_set_status(req, HTTPD_500); // Set response to error 500
                }
            }
        } else if(e == ESP_ERR_NOT_FOUND) { // no namespace requested
            e = esp32_manager_webconfig_page_setup(esp32_manager_webconfig_buffer, req); // Return setup page
            if(e == ESP_OK) {
                ESP_LOGD(TAG, "Setup page generated");
            } else {
                ESP_LOGE(TAG, "Error generating setup page: %s", esp_err_to_name(e));
                httpd_resp_set_status(req, HTTPD_500); // Set response to error 500
            }
        } else {
            ESP_LOGE(TAG, "Error: query does not fit buffer: %s", esp_err_to_name(e));
            httpd_resp_set_status(req, HTTPD_500); // Set response to error 500
        }
    } else if(e == ESP_ERR_NOT_FOUND) { // there is no query string
        ESP_LOGD(TAG, "No query string. Returning setup page.");
        e = esp32_manager_webconfig_page_setup(esp32_manager_webconfig_buffer, req); // Return setup page
        if(e == ESP_OK) {
            ESP_LOGD(TAG, "Setup page generated");
        } else {
            ESP_LOGE(TAG, "Error generating setup page: %s", esp_err_to_name(e));
            httpd_resp_set_status(req, HTTPD_500); // Set response to error 500
        }
    } else {
        ESP_LOGE(TAG, "Error processing query string: %s", esp_err_to_name(e));
        httpd_resp_set_status(req, HTTPD_500); // Set response to error 500
    }

