pablobacho/esp32-manager/esp32_manager_webconfig.c
    e = httpd_resp_set_hdr(req, "Cache-Control", "no-cache, no-store, must-revalidate");
    e += httpd_resp_set_hdr(req, "Pragma", "no-cache");
    e += httpd_resp_set_hdr(req, "Expires", "0");
    if(e != ESP_OK) {
        ESP_LOGE(TAG, "Error settings cache headers");
    }

    e = httpd_resp_send(req, esp32_manager_webconfig_buffer, strlen(esp32_manager_webconfig_buffer));
    if(e == ESP_OK) {
        ESP_LOGD(TAG, "Response sent");
        return ESP_OK;
    } else {
        ESP_LOGE(TAG, "Error sending response");
        return ESP_FAIL;
    }
}

esp_err_t esp32_manager_webconfig_uri_handler_get(httpd_req_t * req)
{
    esp_err_t e;

    size_t recv_size = MIN(httpd_req_get_url_query_len(req)+1, sizeof(esp32_manager_webconfig_content)-1);
    ESP_LOGD(TAG, "Request header size: %d", recv_size);

    // Get request query
    e = httpd_req_get_url_query_str(req, esp32_manager_webconfig_content, recv_size);
    if(e == ESP_OK) {
        ESP_LOGD(TAG, "Query string: %s", esp32_manager_webconfig_content);
        // Search for namespace key
        e = httpd_query_key_value(esp32_manager_webconfig_content, WEBCONFIG_MANAGER_URI_PARAM_NAMESPACE, esp32_manager_webconfig_buffer, sizeof(esp32_manager_webconfig_buffer));
        if(e == ESP_OK) { // Requesting namespace page
            // Get namespace handle
            esp32_manager_namespace_t * namespace = NULL;
            for(uint8_t i=0; i < ESP32_MANAGER_NAMESPACES_SIZE; ++i) {
                if(esp32_manager_namespaces[i] != NULL) {
                    if(!strcmp(esp32_manager_webconfig_buffer, esp32_manager_namespaces[i]->key)) {
                        namespace = esp32_manager_namespaces[i];
                        break;
                    }
                }
            }
            // if requested namespace exists
            if(namespace != NULL) {
                e = httpd_query_key_value(esp32_manager_webconfig_content, WEBCONFIG_MANAGER_URI_PARAM_ENTRY, esp32_manager_webconfig_buffer, sizeof(esp32_manager_webconfig_buffer));
                esp32_manager_entry_t * entry = NULL;
                for(uint8_t i=0; i < namespace->size; ++i) {
                    if(!strcmp(esp32_manager_webconfig_buffer, namespace->entries[i]->key)) {
                        entry = namespace->entries[i];
                        break;
                    }
                }
                // if requested entry exists
                if(entry != NULL) {
                    // Print raw value on response buffer
                    e = entry->to_string(entry, esp32_manager_webconfig_buffer);
                    if(e == ESP_OK) {
                        ESP_LOGD(TAG, "Entry %s.%s converted to %s", namespace->key, entry->key, esp32_manager_webconfig_buffer);
                    } else {
                        ESP_LOGE(TAG, "Error converting entry %s.%s to string", namespace->key, entry->key);
                        strcpy(esp32_manager_webconfig_buffer, "Error: invalid format");
                        httpd_resp_set_status(req, HTTPD_500);
                    }
                    ESP_LOGD(TAG, "Response content: %s", esp32_manager_webconfig_buffer);
                } else {
                    ESP_LOGE(TAG, "Requested namespace does not exist");
                    strcpy(esp32_manager_webconfig_buffer, "ERROR: Requested setting does not exist");
                    httpd_resp_set_status(req, HTTPD_404);
                }
            } else { // namespace does not exist
                ESP_LOGE(TAG, "Requested namespace does not exist");
                strcpy(esp32_manager_webconfig_buffer, "ERROR: Requested namespace does not exist");
                httpd_resp_set_status(req, HTTPD_404);
            }
        } else if(e == ESP_ERR_NOT_FOUND) { // no namespace requested
            ESP_LOGE(TAG, "No namespace found");
            strcpy(esp32_manager_webconfig_buffer, "ERROR: No namespace found");
            httpd_resp_set_status(req, HTTPD_404);
        } else {
            ESP_LOGE(TAG, "Error: query does not fit buffer: %s", esp_err_to_name(e));
            strcpy(esp32_manager_webconfig_buffer, "ERROR: Query does not fit buffer");
            httpd_resp_set_status(req, HTTPD_500);
        }
    } else {
        ESP_LOGE(TAG, "Error: no query string");
        httpd_resp_set_status(req, HTTPD_404);
    }

    e = httpd_resp_set_hdr(req, "Cache-Control", "no-cache, no-store, must-revalidate");
    e += httpd_resp_set_hdr(req, "Pragma", "no-cache");
    e += httpd_resp_set_hdr(req, "Expires", "0");
    if(e != ESP_OK) {
        ESP_LOGE(TAG, "Error settings cache headers");
    }

    e = httpd_resp_send(req, esp32_manager_webconfig_buffer, strlen(esp32_manager_webconfig_buffer));
    if(e == ESP_OK) {
        ESP_LOGD(TAG, "Response sent");
        return ESP_OK;
    } else {
        ESP_LOGE(TAG, "Error sending response");
        return ESP_FAIL;
    }
}

esp_err_t esp32_manager_webconfig_uri_handler_factory(httpd_req_t * req)
{
    esp_err_t e;

    size_t recv_size = MIN(httpd_req_get_url_query_len(req)+1, sizeof(esp32_manager_webconfig_content)-1);
    ESP_LOGD(TAG, "Request header size: %d", recv_size);

    // Get request query
    e = httpd_req_get_url_query_str(req, esp32_manager_webconfig_content, recv_size);
    if(e == ESP_OK) {
        ESP_LOGD(TAG, "Query string: %s", esp32_manager_webconfig_content);
        // Search for operation key
        e = httpd_query_key_value(esp32_manager_webconfig_content, WEBCONFIG_MANAGER_URI_PARAM_REBOOT_DEVICE, esp32_manager_webconfig_buffer, sizeof(esp32_manager_webconfig_buffer));
        if(e == ESP_OK) { // Reboot requested
            esp32_manager_webconfig_page_reboot(esp32_manager_webconfig_buffer, req);
            esp32_manager_webconfig_deferred_reboot(WEBCONFIG_MANAGER_REBOOT_DELAY);
        }
        e = httpd_query_key_value(esp32_manager_webconfig_content, WEBCONFIG_MANAGER_URI_PARAM_FACTORY_RESET, esp32_manager_webconfig_buffer, sizeof(esp32_manager_webconfig_buffer));
        if(e == ESP_OK) { // Factory reset requested
            e = httpd_query_key_value(esp32_manager_webconfig_content, WEBCONFIG_MANAGER_URI_PARAM_REBOOT_DEVICE, esp32_manager_webconfig_buffer, sizeof(esp32_manager_webconfig_buffer));
            for(uint8_t i=0; i < ESP32_MANAGER_NAMESPACES_SIZE; ++i) {
                esp32_manager_namespace_nvs_erase(esp32_manager_namespaces[i]);
            }
            esp32_manager_webconfig_page_reboot(esp32_manager_webconfig_buffer, req);
            esp32_manager_webconfig_deferred_reboot(WEBCONFIG_MANAGER_REBOOT_DELAY);
        }
    }

