pablobacho/esp32-manager/esp32_manager_webconfig.c
    e = httpd_resp_set_hdr(req, "Cache-Control", "no-cache, no-store, must-revalidate");
    e += httpd_resp_set_hdr(req, "Pragma", "no-cache");
    e += httpd_resp_set_hdr(req, "Expires", "0");
    if(e != ESP_OK) {
        ESP_LOGE(TAG, "Error settings cache headers");
    }

    e = httpd_resp_send(req, esp32_manager_webconfig_buffer, strlen(esp32_manager_webconfig_buffer));
    if(e == ESP_OK) {
        ESP_LOGD(TAG, "Response sent");
        return ESP_OK;
    } else {
        ESP_LOGE(TAG, "Error sending response");
        return ESP_FAIL;
    }
}

esp_err_t esp32_manager_webconfig_page_root(char * buffer, httpd_req_t * req)
{
    if(req == NULL || buffer == NULL) {
        ESP_LOGE(TAG, "req and buffer cannot be NULL");
        return ESP_ERR_INVALID_ARG;
    }

    // FIXME Buffer overrun protection

    // TODO Show featured values on home page
    // For now it is just a link to setup

    strcpy(buffer, "<html><head><link rel=\"stylesheet\" href=\"style.min.css\" /><meta name=\"viewport\" content=\"width=device-width, initial-scale=1\" />");
    strcat(buffer, WEBCONFIG_MANAGER_WEB_TITLE);
    strcat(buffer, "</head><body><p><a class=\"button\" href=\"/setup\">Setup</a></a></body>");

    return ESP_OK;
}

esp_err_t esp32_manager_webconfig_page_reboot(char * buffer, httpd_req_t * req)
{
    if(req == NULL || buffer == NULL) {
        ESP_LOGE(TAG, "req and buffer cannot be NULL");
        return ESP_ERR_INVALID_ARG;
    }

    // FIXME Buffer overrun protection

    strcpy(buffer, "<html><head><link rel=\"stylesheet\" href=\"style.min.css\" /><meta name=\"viewport\" content=\"width=device-width, initial-scale=1\" />");
    strcat(buffer, WEBCONFIG_MANAGER_WEB_TITLE);
    strcat(buffer, "</head><body><h2>Rebooting device</h2><p>Wait 10 seconds before clicking <a href=\"/setup\">back</a> (Link might not work if network settings were changed)</p></body>");

    return ESP_OK;
}

esp_err_t esp32_manager_webconfig_page_setup(char * buffer, httpd_req_t * req)
{
    if(req == NULL || buffer == NULL) {
        ESP_LOGE(TAG, "req and buffer cannot be NULL");
        return ESP_ERR_INVALID_ARG;
    }

    // FIXME Buffer overrun protection
    ESP_LOGD(TAG, "Generating setup page");

    strcpy(buffer, "<html><head><link rel=\"stylesheet\" href=\"style.min.css\" /><meta name=\"viewport\" content=\"width=device-width, initial-scale=1\" />");
    strcat(buffer, WEBCONFIG_MANAGER_WEB_TITLE);
    strcat(buffer, "</head><body><ul>");
    for(uint8_t i=0; i < ESP32_MANAGER_NAMESPACES_SIZE; ++i) {
        if(esp32_manager_namespaces[i] != NULL) {
            strcat(buffer, "<li><a href=\"/setup?namespace=");
            strcat(buffer, esp32_manager_namespaces[i]->key);
            strcat(buffer, "\">");
            strcat(buffer, esp32_manager_namespaces[i]->friendly);
            strcat(buffer, "</a></li>");
        }
    }
    strcat(buffer, "</ul><a class=\"button button-outline\" href=\"/factory?");
    strcat(buffer, WEBCONFIG_MANAGER_URI_PARAM_REBOOT_DEVICE);
    strcat(buffer, "=1\">Reboot device</a><a class=\"button button-clear\" href=\"/factory?");
    strcat(buffer, WEBCONFIG_MANAGER_URI_PARAM_FACTORY_RESET);
    strcat(buffer, "=1\">Factory reset</a></body></html>");

    return ESP_OK;
}

esp_err_t esp32_manager_webconfig_page_setup_namespace(char * buffer, httpd_req_t * req, esp32_manager_namespace_t * namespace)
{
    if(req == NULL || buffer == NULL || namespace == NULL) {
        ESP_LOGE(TAG, "Invalid arguments");
        return ESP_ERR_INVALID_ARG;
    }

    // FIXME Buffer overrun protection

    strcpy(buffer, "<html><head><link rel=\"stylesheet\" href=\"style.min.css\" media=\"screen\" /><meta name=\"viewport\" content=\"width=device-width, initial-scale=1\" />");
    strcat(buffer, WEBCONFIG_MANAGER_WEB_TITLE);
    strcat(buffer, "</head><body><form method=\"get\" action=\"/setup\"><br/><input name=\"namespace\" type=\"hidden\" value=\"");
    strcat(buffer, namespace->key);
    strcat(buffer, "\"><br/>");

    for(uint16_t i=0; i < namespace->size; ++i) {
        if(namespace->entries[i] == NULL) continue;

        esp32_manager_entry_t * entry = namespace->entries[i];
        if(entry->html_form_widget != NULL) {
            entry->html_form_widget(entry, &buffer[strlen(buffer)]);
        } else {
            esp32_manager_webconfig_html_form_widget_default(entry, &buffer[strlen(buffer)]);
        }
    }

    strcat(buffer, "<input type=\"submit\" value=\"submit\"></form><a class=\"button button-outline\" href=\"/setup\">Back</a>");

    strcat(buffer, "<a class=\"button button-clear\" href=\"/setup?namespace=");
    strcat(buffer, namespace->key);
    strcat(buffer, "&");
    strcat(buffer, WEBCONFIG_MANAGER_URI_PARAM_FACTORY_RESET);
    strcat(buffer, "=1\">Restore defaults</a>");

    strcat(buffer, "</body></html>");

    return ESP_OK;
}

esp_err_t esp32_manager_webconfig_html_form_widget_default(esp32_manager_entry_t * entry, char * dest)
{
    strcpy(dest, "<div>");
    strcat(dest, entry->friendly);
    strcat(dest, "<br/>");

    switch(entry->type) {
        case i8:
        case i16:
        case i32:
        case i64:
        case u8:
        case u16:
        case u32:
        case u64:
        case flt:
        case dbl:
            // <input type="number" name="[entry.key]" value="[entry.value]" />
            strcat(dest, "<input type=\"number\" name=\"");
            strcat(dest, entry->key);
            strcat(dest, "\" value=\"");
            uint16_t len = strlen(dest);
            entry->to_string(entry, &dest[len]);
            strcat(dest, "\"");
            if((entry->attributes & ESP32_MANAGER_ATTR_WRITE) == 0) {
                strcat(dest, "disabled");
            }
            strcat(dest, " />");
            break;
        case text: // This type needs to be null-terminated
            strcat(dest, "<input type=\"text\" name=\"");
            strcat(dest, entry->key);
            strcat(dest, "\" value=\"");
            strcat(dest, (char *) entry->value);
            strcat(dest, "\"");
            if((entry->attributes & ESP32_MANAGER_ATTR_WRITE) == 0) {
                strcat(dest, "readonly");
            }
            strcat(dest, " />");
            break;
        case password:
            strcat(dest, "<input type=\"password\" name=\"");
            strcat(dest, entry->key);
            strcat(dest, "\" value=\"");
            strcat(dest, (char *) entry->value);
            strcat(dest, "\"");
            if((entry->attributes & ESP32_MANAGER_ATTR_WRITE) == 0) {
                strcat(dest, "readonly");
            }
            strcat(dest, " />");
            break;
        // TODO Implement these cases
        case single_choice:
        case multiple_choice:
        case blob: // Data structures, binary and other non-null-terminated types go here
        case image:
            ESP_LOGE(TAG, "Not implemented");
            //nvs_set_blob(handle->nvs_handle, entry->key, entry->value, size);
        break;
        default:
            ESP_LOGE(TAG, "Entry %s is of an unknown type", entry->key);
        break;
        }
        strcat(dest, "</div>");

        return ESP_OK;
}

esp_err_t esp32_manager_webconfig_deferred_reboot(uint32_t delay)
{
    if(xTaskCreate(esp32_manager_webconfig_deferred_reboot_task, "deferred_reboot", (void *) 2048, delay, 10, NULL) == pdPASS) {
        return ESP_OK;
    } else {
        return ESP_FAIL;
    }
}

void esp32_manager_webconfig_deferred_reboot_task(void * pvParameter)
{
    vTaskDelay(((uint32_t) pvParameter)/portTICK_PERIOD_MS);
    esp_restart();
}

esp_err_t esp32_manager_webconfig_urldecode(char *__restrict__ dest, const char *__restrict__ src)
{
    char * index_dest;
    const char * index_src; // Pointers to work with both buffers
	const char * end = src + strlen(src); // This pointer tells us when we reach the end of the source string
	unsigned int c; // Temporari variable to work with individual chars

    // Set index_dest and index_src to the origin of their respective strings (their 0th element)
    // While index_src hasn't reached the end of the string
    // At the end increment the position of index_dest
	for (index_dest = dest, index_src = src; index_src <= end; index_dest++) {
		c = *index_src++;   // Read the character in the current position and move pointer one element forward
		if (c == '+') { // Replace '+' with spaces ' '
            c = ' ';
        } else if (c == '%') { // If found a %
            if(ISHEX(*(index_src)) && ISHEX(*(index_src +1))) { // Make sure the following 2 chars are hexadecimal digits
                sscanf(index_src, "%2x", &c); // Turn that value into its ascii character
                index_src += 2; // Move index_src to the next valid caracter of the string
            } else {
                return ESP_FAIL; // If % is not followed by 2 hexadecimal digits the source string is wrong
            }
        }

        *index_dest = c; // Whether it is the original character, or one converted from + or hex, copy it to the destination string
	}
    return ESP_OK;
}